In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
randn(5,4)

array([[ 0.08197146,  0.0514628 , -0.52610816,  0.09743199],
       [ 0.55911886, -0.49191024,  0.10079303, -0.42059297],
       [ 1.40996666,  0.6309248 ,  0.33691467, -0.93539676],
       [ 1.04676447, -0.47171581, -0.08751593,  1.15312225],
       [-1.09101556,  0.12076134,  0.71027308,  1.47581659]])

In [7]:
df = pd.DataFrame(randn(5,4), index ='A B C D E'.split(), columns='W X Y Z'.split())

In [8]:
df

          W         X         Y         Z
A -0.714724 -0.980361 -1.314948  1.249168
B -0.462291  1.256757  0.232738  0.446275
C  0.428947  1.201007 -0.247190 -0.666745
D -2.179246  0.401203  0.720078 -0.021036
E -1.006415  0.965801 -0.670609  1.861427

In [9]:
df['W']

A   -0.714724
B   -0.462291
C    0.428947
D   -2.179246
E   -1.006415
Name: W, dtype: float64

In [10]:
df[['W','Z']]

          W         Z
A -0.714724  1.249168
B -0.462291  0.446275
C  0.428947 -0.666745
D -2.179246 -0.021036
E -1.006415  1.861427

In [11]:
#Add a new column
df['New'] = [3,4,5,6,7]

In [12]:
df

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [13]:
df['Newcol'] = df['W'] + df['X']

In [14]:
df

          W         X         Y         Z  New    Newcol
A -0.714724 -0.980361 -1.314948  1.249168    3 -1.695086
B -0.462291  1.256757  0.232738  0.446275    4  0.794466
C  0.428947  1.201007 -0.247190 -0.666745    5  1.629954
D -2.179246  0.401203  0.720078 -0.021036    6 -1.778042
E -1.006415  0.965801 -0.670609  1.861427    7 -0.040614

In [19]:
df.drop('Newcol', axis=1, inplace=True)

In [20]:
df

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [21]:
df.drop('A')

          W         X         Y         Z  New
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [26]:
df

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [25]:
#how to select a row
df.iloc[0]

W     -0.714724
X     -0.980361
Y     -1.314948
Z      1.249168
New    3.000000
Name: A, dtype: float64

In [27]:
df.loc['A']

W     -0.714724
X     -0.980361
Y     -1.314948
Z      1.249168
New    3.000000
Name: A, dtype: float64

In [29]:
df.iloc[0:3]

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5

In [30]:
df.loc[['A', 'C']]

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
C  0.428947  1.201007 -0.247190 -0.666745    5

In [39]:
df.loc[df['New']>3]

          W         X         Y         Z  New
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [41]:
df.loc['A']['X']

-0.9803613799935714

In [42]:
df

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [43]:
df>0

       W      X      Y      Z   New
A  False  False  False   True  True
B  False   True   True   True  True
C   True   True  False  False  True
D  False   True   True  False  True
E  False   True  False   True  True

In [45]:
# how many values are greater than zero
(df>0).sum()

W      1
X      4
Y      2
Z      3
New    5
dtype: int64

In [46]:
(df>0).sum().sum()

15

In [47]:
df[df>0]

          W         X         Y         Z  New
A       NaN       NaN       NaN  1.249168    3
B       NaN  1.256757  0.232738  0.446275    4
C  0.428947  1.201007       NaN       NaN    5
D       NaN  0.401203  0.720078       NaN    6
E       NaN  0.965801       NaN  1.861427    7

In [48]:
df[df['W']>0]

          W         X        Y         Z  New
C  0.428947  1.201007 -0.24719 -0.666745    5

In [49]:
df[df['W']<0]

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [51]:
df[df['W']<0][['W','Y']]

          W         Y
A -0.714724 -1.314948
B -0.462291  0.232738
D -2.179246  0.720078
E -1.006415 -0.670609

In [52]:
df

          W         X         Y         Z  New
A -0.714724 -0.980361 -1.314948  1.249168    3
B -0.462291  1.256757  0.232738  0.446275    4
C  0.428947  1.201007 -0.247190 -0.666745    5
D -2.179246  0.401203  0.720078 -0.021036    6
E -1.006415  0.965801 -0.670609  1.861427    7

In [53]:
states = ['NY','IN', 'ST', 'RT', 'PP']
df['states'] = states

In [54]:
df

          W         X         Y         Z  New states
A -0.714724 -0.980361 -1.314948  1.249168    3     NY
B -0.462291  1.256757  0.232738  0.446275    4     IN
C  0.428947  1.201007 -0.247190 -0.666745    5     ST
D -2.179246  0.401203  0.720078 -0.021036    6     RT
E -1.006415  0.965801 -0.670609  1.861427    7     PP

In [58]:
df.reset_index(inplace=True)

In [62]:
df.set_index('states', inplace=True)

In [63]:
df

       index         W         X         Y         Z  New
states
NY         A -0.714724 -0.980361 -1.314948  1.249168    3
IN         B -0.462291  1.256757  0.232738  0.446275    4
ST         C  0.428947  1.201007 -0.247190 -0.666745    5
RT         D -2.179246  0.401203  0.720078 -0.021036    6
PP         E -1.006415  0.965801 -0.670609  1.861427    7

In [65]:
df.loc['IN']

index           B
W       -0.462291
X         1.25676
Y        0.232738
Z        0.446275
New             4
Name: IN, dtype: object

index heirarchy

In [66]:
df1 = df

In [68]:
df1.reset_index(inplace=True)

In [69]:
df1['country'] = ['US', 'IN','US', 'IN','US']

In [70]:
df1

  states index         W         X         Y         Z  New country
0     NY     A -0.714724 -0.980361 -1.314948  1.249168    3      US
1     IN     B -0.462291  1.256757  0.232738  0.446275    4      IN
2     ST     C  0.428947  1.201007 -0.247190 -0.666745    5      US
3     RT     D -2.179246  0.401203  0.720078 -0.021036    6      IN
4     PP     E -1.006415  0.965801 -0.670609  1.861427    7      US

In [71]:
df1.set_index(['country', states])

           states index         W         X         Y         Z  New
country
US      NY     NY     A -0.714724 -0.980361 -1.314948  1.249168    3
IN      IN     IN     B -0.462291  1.256757  0.232738  0.446275    4
US      ST     ST     C  0.428947  1.201007 -0.247190 -0.666745    5
IN      RT     RT     D -2.179246  0.401203  0.720078 -0.021036    6
US      PP     PP     E -1.006415  0.965801 -0.670609  1.861427    7

In [72]:
outside = ['G1','G1','G1','G2','G2','G2' ]
inside = [1,2,3,4,5,6]
heir_index = list(zip(outside, inside))

In [73]:
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 4), ('G2', 5), ('G2', 6)]

In [74]:
heir_index = pd.MultiIndex.from_tuples(heir_index)

In [75]:
heir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 4),
            ('G2', 5),
            ('G2', 6)],
           )

In [78]:
df_heir = pd.DataFrame(randn(6,2), index = heir_index, columns ='data1 data2'.split())

In [79]:
df_heir

         data1     data2
G1 1  1.243180 -2.095454
   2 -0.357792  0.951110
   3 -1.709739  1.029394
G2 4  0.084353  0.696275
   5 -0.819726 -0.298821
   6  0.048072 -1.425691

In [80]:
df_heir.loc['G1']

      data1     data2
1  1.243180 -2.095454
2 -0.357792  0.951110
3 -1.709739  1.029394

In [86]:
df_heir.loc['G1']['data1'].loc[2]

-0.35779226795141383

In [88]:
df_heir

         data1     data2
G1 1  1.243180 -2.095454
   2 -0.357792  0.951110
   3 -1.709739  1.029394
G2 4  0.084353  0.696275
   5 -0.819726 -0.298821
   6  0.048072 -1.425691

In [89]:
df_heir.index.names = ['Grp', 'Num']

In [90]:
df_heir

            data1     data2
Grp Num
G1  1    1.243180 -2.095454
    2   -0.357792  0.951110
    3   -1.709739  1.029394
G2  4    0.084353  0.696275
    5   -0.819726 -0.298821
    6    0.048072 -1.425691

In [95]:
df_heir.xs(1,level='Num')

       data1     data2
Grp
G1   1.24318 -2.095454

In [97]:
df_heir.xs('G2',level='Grp')

        data1     data2
Num
4    0.084353  0.696275
5   -0.819726 -0.298821
6    0.048072 -1.425691

In [98]:
df_heir.xs(4,level='Num')

        data1     data2
Grp
G2   0.084353  0.696275

In [99]:
d = {'num_legs': [4, 4, 2, 2],
      'num_wings': [0, 0, 2, 2],
      'class': ['mammal', 'mammal', 'mammal', 'bird'],
      'animal': ['cat', 'dog', 'bat', 'penguin'],
      'locomotion': ['walks', 'walks', 'flies', 'walks']}
df = pd.DataFrame(data=d)
df = df.set_index(['class', 'animal', 'locomotion'])
df

                           num_legs  num_wings
class  animal  locomotion
mammal cat     walks              4          0
       dog     walks              4          0
       bat     flies              2          2
bird   penguin walks              2          2

In [101]:
df.xs('walks',level ='locomotion')

                num_legs  num_wings
class  animal
mammal cat             4          0
       dog             4          0
bird   penguin         2          2

In [102]:
df.xs('cat', level='animal')

                   num_legs  num_wings
class  locomotion
mammal walks              4          0

In [103]:
df.xs('mammal')

                   num_legs  num_wings
animal locomotion
cat    walks              4          0
dog    walks              4          0
bat    flies              2          2

In [ ]:
df.xs()